<a href="https://colab.research.google.com/github/milhamm/knn-introduction-to-ai/blob/main/AI_Programming_Assignment_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Group 2 AI Assignment - kNN**

In [ ]:
import numpy as np
import pandas as pd
from math import sqrt

## **Data Reading**

In [ ]:
data = pd.read_excel("https://github.com/milhamm/knn-introduction-to-ai/blob/main/mobil.xls?raw=true")
test_data = pd.read_excel("https://github.com/milhamm/knn-introduction-to-ai/blob/main/test.xls?raw=true")
display(data)
display(test_data.head())

              Nama Mobil  Ukuran  ...  Kecepatan  Harga (Ratus Juta)
0            Toyota Agya       4  ...          6                1.00
1          Daihatsu Alya       4  ...          6                1.10
2          Toyota Avanza       6  ...          6                2.00
3         Daihatsu Xenia       6  ...          6                1.75
4                Xpander       7  ...          7                2.25
5                 Livina       7  ...          7                2.10
6                Karimun       3  ...          5                1.20
7          Toyota Innova       8  ...          7                4.00
8                Alphard       9  ...          8               10.00
9            Toyota Vios       5  ...          8                2.50
10            Honda City       5  ...          8                2.70
11          Toyota Hiace      10  ...          6                5.00
12       Toyota Fortuner       9  ...          8                5.00
13           Toyota Foxy       9  ...          7                5.50
14  Toyota Corolla Altis       5  ...          9                6.00
15         Suzuki Ertiga       7  ...          7                2.30
16          Suzuki Carry       7  ...          5                0.80

[17 rows x 6 columns]

  Nama Mobil  Ukuran  Kenyamanan  Irit  Kecepatan  Harga (Ratus Juta)
0          ?       3           8     8          5                 2.7

## **Data Preprocessing**

In [ ]:
# Check for null values
print(data.isna().sum())

# Drop the name column
df = data.drop(["Nama Mobil"], axis = 1)
df_test = test_data.drop(["Nama Mobil"], axis = 1)

# Convert dataframe to array
df_list = df.values
df_test_list = df_test.values[0]

Nama Mobil            0
Ukuran                0
Kenyamanan            0
Irit                  0
Kecepatan             0
Harga (Ratus Juta)    0
dtype: int64

## **Distance Methods**

In [ ]:
def manhattan(x, y):
  return sum([abs(x[i] - y[i]) for i in range(len(x))])

def euclidean(x, y):
  return sqrt(sum([(x[i] - y[i]) ** 2 for i in range(len(x))]))

def minkowski(x, y, r):
  return sum([abs(x[i] - y[i]) ** r for i in range(len(x))]) ** (1./ r)

def supremum(x, y):
  return max([abs(x[i] - y[i]) for i in range(len(x))])

## **k-Nearest Neighbour**

In [ ]:
def knn(k):
  manhattan_distance = []
  euclidean_distance = []
  minkowski_distance = []
  supremum_distance = []
  
  for x in df_list:
    manhattan_distance.append(manhattan(x, df_test_list))
    euclidean_distance.append(euclidean(x, df_test_list))
    minkowski_distance.append(minkowski(x, df_test_list, 5))
    supremum_distance.append(supremum(x, df_test_list))
  data["manhattan"], data["euclidean"], data["minkowski"], data["supremum"]  = manhattan_distance, euclidean_distance, minkowski_distance, supremum_distance

  manhattan_sorted = data.sort_values(by=['manhattan'])[:k]
  euclidean_sorted = data.sort_values(by=['euclidean'])[:k]
  minkowski_sorted = data.sort_values(by=['minkowski'])[:k]
  supremum_sorted = data.sort_values(by=['supremum'])[:k]

  manhattan_sorted["Nama Mobil"].to_excel('rekomendasi_manhattan.xls', index=False, header=False)
  euclidean_sorted["Nama Mobil"].to_excel('rekomendasi_euclidean.xls', index=False, header=False)
  minkowski_sorted["Nama Mobil"].to_excel('rekomendasi_minkowski.xls', index=False, header=False)
  supremum_sorted["Nama Mobil"].to_excel('rekomendasi_supremum.xls', index=False, header=False)

  return manhattan_sorted, euclidean_sorted, minkowski_sorted, supremum_sorted

man, euc, min, sup = knn(3)

print("Manhanttan")
display(man)
print("")
print("Euclidian")
display(euc)
print("")
print("Minkowski")
display(min)
print("")
print("Supremum")
display(sup)
print("")

Manhanttan

     Nama Mobil  Ukuran  Kenyamanan  ...  euclidean  minkowski  supremum
10   Honda City       5           8  ...   3.741657   3.077385       3.0
9   Toyota Vios       5           7  ...   3.878144   3.079612       3.0
6       Karimun       3           4  ...   4.716991   4.030465       4.0

[3 rows x 10 columns]

Euclidian

     Nama Mobil  Ukuran  Kenyamanan  ...  euclidean  minkowski  supremum
10   Honda City       5           8  ...   3.741657   3.077385       3.0
9   Toyota Vios       5           7  ...   3.878144   3.079612       3.0
0   Toyota Agya       4           4  ...   4.678675   4.013347       4.0

[3 rows x 10 columns]

Minkowski

       Nama Mobil  Ukuran  Kenyamanan  ...  euclidean  minkowski  supremum
10     Honda City       5           8  ...   3.741657   3.077385       3.0
9     Toyota Vios       5           7  ...   3.878144   3.079612       3.0
2   Toyota Avanza       6           5  ...   4.846648   3.491898       3.0

[3 rows x 10 columns]

Supremum

       Nama Mobil  Ukuran  Kenyamanan  ...  euclidean  minkowski  supremum
2   Toyota Avanza       6           5  ...   4.846648   3.491898       3.0
10     Honda City       5           8  ...   3.741657   3.077385       3.0
9     Toyota Vios       5           7  ...   3.878144   3.079612       3.0

[3 rows x 10 columns]